{"inkVersion":20,"root":[["^\"What seems to be the matter?\" ",{"#":"changeSpeakerName-Freya"},"\n","^\"I need you to bring me ingredients for a soup\" ",{"#":"changeSpeakerName-Magnus"},"\n","^Magnus declared, his presence commanding attention in the ancient chamber of the tower. The flickering candlelight danced upon the array of potion bottles and mystical apparatus surrounding him. ",{"#":"changeSpeakerName-Freya"},{"#":"option-0-changesInkFile-Dialogues/Magnus/MagnusMissionTwoEnded"},{"#":"option-0-addGatherQuest-GatherQuests/Shrooms"},"\n","ev","str","^\"Consider it done, Magnus\"","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^\"I'm not able to help you right now.\"","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["\n",{"->":"mission"},{"->":"0.g-0"},{"#f":5}],"c-1":["\n","end",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"mission":["^I responded, ready to embark on yet another quest within the enchanting confines of the tower. His request, though seemingly simple, held the promise of a culinary alchemy that transcended the mundane. ",{"#":"changeSpeakerName-Freya"},"\n","^With a wave of his hand, Magnus conjured a listing of components required for the soup. The aged paper spoke of culinary arts intertwined with the magical, an echo of medieval gastronomy steeped in mystery.","\n","^\"The soup, my apprentice, demands the essence of nature's bounty. Seek out the treasures of the forest and the earth—the Bolete, Chanterelle, and Boletus. Let their flavors weave a tapestry of enchantment.\" ",{"#":"changeSpeakerName-Magnus"},"\n","^Magnus explained, his words resonating with an ancient wisdom that transcended time. ",{"#":"changeSpeakerName-Freya"},"\n","^Embraced by the tower's medieval ambiance, I ventured into its hidden corners. The air was thick with the fragrance of ancient tomes and the anticipation of culinary alchemy. The flickering candlelight played upon the parchment, transforming the list of ingredients into a map of gastronomic enchantment.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}