{"inkVersion":20,"root":[["^\"Greetings, Magnus\" ",{"#":"changeSpeakerName-Freya"},"\n","^\"Did you aquired the mashrooms?\" ",{"#":"option-0-removeItem-Items/Bolete-1"},{"#":"option-0-removeItem-Items/Boletus-1"},{"#":"option-0-removeItem-Items/Chanterelle-1"},{"#":"option-0-changesRelation-Magnus-30-plus"},{"#":"option-0-changesInkFile-Dialogues/Magnus/Magnus_Mission_three"},{"#":"option-1-forceCloseDialogue"},"\n","ev","str","^\"I've procured the mushrooms you requested.\"","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^\"Not yet.\"","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["\n",{"->":"mission"},{"->":"0.g-0"},{"#f":5}],"c-1":["\n","end",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"mission":["^\"Excellent. Your efficiency in herb gathering continues to impress. These mushrooms shall add a touch of enchantment to our magical concoction.\" ",{"#":"changeSpeakerName-Magnus"},"\n","^Magnus commended, his eyes sparkling with anticipation. ",{"#":"changeSpeakerName-Freya"},"\n","^\"Now, let the alchemical symphony commence. Take a seat at the dinner table, for a feast of both flavors and magic awaits.\" ",{"#":"changeSpeakerName-Magnus"},"\n","^As Magnus prepared the cauldron for the soup, the air within the chamber became infused with the tantalizing aroma of Bolete, Chanterelle, and Boletus. The ancient walls of the tower seemed to resonate with the harmonious blend of nature's gifts and magical prowess. ",{"#":"changeSpeakerName-Freya"},"\n","^\"Your involvement in the magical arts extends beyond potion-making, my apprentice. A wizard's journey is as much about savoring the magical feast as it is about concocting it.\" ",{"#":"changeSpeakerName-Magnus"},"\n","^Magnus mused, pouring the ingredients into the cauldron with practiced precision. ",{"#":"changeSpeakerName-Freya"},"\n","^Seated at the dinner table, I marveled at the alchemical dance before me. The bubbling potion emitted a magical glow, and each stir of Magnus's ladle seemed to weave an invisible spell.","\n","^\"Tonight, we dine not just on soup but on the essence of nature and magic. A feast for both body and spirit.\" ",{"#":"changeSpeakerName-Magnus"},"\n","^Magnus declared, filling the room with the warmth of his words and the enchantment of the simmering soup. ",{"#":"changeSpeakerName-Freya"},"\n","end",{"#f":1}],"#f":1}],"listDefs":{}}