{"inkVersion":20,"root":[["^\"Our village is weary of the cruelty of royalty! Though benevolence may have seen an uptick, we've naught to offer our families.\" ",{"#":"changeSpeakerName-Villager"},"\n","^\"The king takes our women as he pleases, and we'll bear it no longer!\"","\n","^Screamed the passionate villager, his words echoing the frustrations of the oppressed. ",{"#":"changeSpeakerName-Freya"},"\n","^\"What course of action do you propose, good sir?\"","\n","^I inquired, acknowledging the gravity of the situation.","\n","^\"We'll need your aid. Fetch us one of them elixirs for power, and we'll rid ourselves of that wretched bastard once and for all.\" ",{"#":"changeSpeakerName-Villager"},"\n","^He declared, the desperation and resolve in his voice palpable. ",{"#":"changeSpeakerName-Freya"},"\n","^\"Violence may not be the wisest path. Perhaps negotiations could yield a better outcome.\"","\n","^I suggested, attempting to guide them toward a more measured approach.","\n","^\"If you haven't lived within the confines of our hamlet, you cannot fathom the agony we endure. Aid us, or refrain from impeding our resolve.\" ",{"#":"changeSpeakerName-Villager"},"\n","^He retorted, the raw pain of his people underscoring the urgency of their plea. ",{"#":"changeSpeakerName-Freya"},"\n","^The conversation unfolded against the backdrop of a hamlet, where the struggle for justice was as timeless as the stones that paved its winding paths. ",{"#":"option-0-changesInkFile-Dialogues/Villagers/RevolutionFinished"},{"#":"option-0-addGatherQuest-GatherQuests/StrenghtAndFire"},{"#":"option-0-advanceTime-4"},{"#":"option-1-forceCloseDialogue"},{"#":"option-0-requiresTime-betweenHours-0-4"},{"#":"option-0-requiresRelation-Villagers-100"},"\n","ev","str","^\"I shall help the least fortunate.\"","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^\"Violence is not the answer.\"","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["\n","end",{"->":"0.g-0"},{"#f":5}],"c-1":["\n","end",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}