{"inkVersion":20,"root":[["^\"After our conversation, it took me considerable effort to face you again.\"","\n","^\"But, as you already know, I am in distress, and I believe you could offer solace.\"","\n","^Queen shared, her regal demeanor softened by a touch of vulnerability. ",{"#":"changeSpeakerName-Freya"},"\n","^\"What do you need me to do?\"","\n","^I asked, standing in the presence of her throne.","\n","^\"As an apprentice to a wizard, you possess knowledge about potions. Do you know anything about poisons?\" ",{"#":"changeSpeakerName-Queen"},"\n","^She inquired, her voice lowered to a confidential tone. ",{"#":"changeSpeakerName-Freya"},"\n","^\"I do. I studied them since I was 10.\"","\n","^I disclosed, the weight of secrecy settling between us.","\n","^\"Perfect. Then let me share my plan with you. Please, bear with me. I want to poison my husband.\" ",{"#":"changeSpeakerName-Queen"},"\n","^She confided, the last sentence whispered in hushed tones that resonated through the royal chamber. ",{"#":"changeSpeakerName-Freya"},"\n","^\"You want to end your husband's life?\"","\n","^I responded in my usual straightforward manner, the nuances of her revelation lost on me.","\n","^\"Idiot!\" ",{"#":"changeSpeakerName-Queen"},"\n","^She exclaimed, casting a wary glance around before taking a composed breath. ",{"#":"changeSpeakerName-Freya"},"\n","^\"I need you to be discreet. This matter is no jest. My husband is a powerful wizard, and I've long desired to be free of him.\" ",{"#":"changeSpeakerName-Queen"},"\n","^\"I cannot resort to conventional poison, for arsenic would be too easily traceable. I have only one chance.\"","\n","^\"My master is also a powerful wizard. Perhaps you should seek his counsel?\" ",{"#":"changeSpeakerName-Freya"},"\n","^I suggested, unaware of the delicate balance between loyalty and newfound confidences.","\n","^\"You cannot tell him about this! I do not trust him, and if you betray me, I will see you hanged.\" ",{"#":"changeSpeakerName-Queen"},"\n","^Suiko warned, her eyes reflecting the desperation of her plea. ",{"#":"changeSpeakerName-Freya"},{"#":"option-0-requiresRelation-Queen-100"},{"#":"option-0-changesInkFile-Dialogues/Queen/PoisonFinished"},{"#":"option-0-addGatherQuest-GatherQuests/Poison"},{"#":"option-1-forceCloseDialogue"},{"#":"option-0-advanceTime-4"},{"#":"option-0-requiresTime-betweenHours-20-24"},{"#":"option-0-addJournalEntry-Plot/queen/potionOfDeath"},"\n","ev","str","^\"Fear will not sustain me, but I do empathize with your plight.\"","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^\"I will not comply with your orders.\"","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["\n",{"->":"mission"},{"->":"0.g-0"},{"#f":5}],"c-1":["\n","end",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"mission":["^What do you expect to happen afterward?\"","\n","^I questioned, delving into the complexities of her plan.","\n","^\"I will find a way to introduce the poison into his wine when he least suspects it. I know him well enough. I've waited for far too long.\" ",{"#":"changeSpeakerName-Queen"},"\n","^Suiko declared, her determination cutting through the air. ",{"#":"changeSpeakerName-Freya"},"\n","^\"What about the kingdom? Do you know how to rule by yourself?\"","\n","^I pressed, emphasizing the broader consequences of her actions.","\n","^\"It's not important.\" ",{"#":"changeSpeakerName-Queen"},"\n","^She dismissed, her focus fixed on the singular goal of liberation. ",{"#":"changeSpeakerName-Freya"},"\n","^\"It is, as your kingdom is your responsibility as a queen.\"","\n","^I asserted, intertwining the threads of duty with the weight of her personal vendetta.","\n","^\"I do not particularly care. If you wish, you can become a part of the royal court, but you must help me.\" ",{"#":"changeSpeakerName-Queen"},"\n","^She proposed, attempting to enlist my aid with the promise of power. ",{"#":"changeSpeakerName-Freya"},"\n","^\"I will not be swayed by the allure of potential influence. I want you to promise that you will take care of your people.\"","\n","^I insisted, grounding the conversation in the principles of leadership.","\n","^\"And you will believe I will do so just because I said it?\" ",{"#":"changeSpeakerName-Queen"},"\n","^She challenged, skepticism lacing her words. ",{"#":"changeSpeakerName-Freya"},"\n","^\"Yes, because a royal's word is sacred.\"","\n","^I replied, embracing the ideals of honor and responsibility. ",{"#":"changeSpeakerName-Queen"},"\n","^She chuckled. ",{"#":"changeSpeakerName-Freya"},"\n","^\"I believe you to be naive, but if you truly have that one expectation, then I shall commit to it.\" ",{"#":"changeSpeakerName-Queen"},"\n","^\"I will take my leave now. I will bring you that potion.\" ",{"#":"changeSpeakerName-Freya"},"\n","^I declared, preparing to embark on a journey that blurred the lines between loyalty and moral quandaries.","\n","^\"Au revoir, grim reaper.\" ",{"#":"changeSpeakerName-Queen"},"\n","^Suiko bid farewell, her words echoing in the regal chamber as the weight of a kingdom's fate hung in the balance. ",{"#":"changeSpeakerName-Freya"},"\n","end",{"#f":1}],"#f":1}],"listDefs":{}}