{"inkVersion":20,"root":[["^\"Oh, child, draw near. Bask in the radiance spilled by my beauty.\"","\n","^The enchanting woman beckoned, her voice a melody of allure. ",{"#":"changeSpeakerName-Freya"},"\n","^\"I am no mere villager. While you indeed possess captivating beauty, your ego casts a shadow even I, the one who beholds you first, can discern.\"","\n","^I responded, a touch of boldness challenging the ethereal charm that surrounded her.","\n","^\"What an ignorant peasant! Your words lack the finesse of a courtier.\" ",{"#":"changeSpeakerName-Queen"},"\n","^She retorted, a hint of disdain in her tone. ",{"#":"changeSpeakerName-Freya"},"\n","^\"Perhaps, but I bear utility. I am a wizard's apprentice.\"","\n","^I declared, standing firm against the enchanting pull of her presence.","\n","^Her eyes widened, and she took a moment to appraise me. Her eyes widened, and she took a moment to assess me.","\n","^A weighty pause hung in the air, laden with unspoken thoughts.","\n","^\"If you hold such importance, the beautiful queen of your village might deem you worthy of a quest.\" ",{"#":"changeSpeakerName-Queen"},"\n","^\"Then, perhaps, you can work your magical talents to recover my lost ring.\" ",{"#":"option-0-changesInkFile-Dialogues/Magnus/RingEnded"},{"#":"option-0-addGatherQuest-GatherQuests/Ring"},{"#":"option-1-forceCloseDialogue"},{"#":"option-0-advanceTime-4"},{"#":"option-0-requiresTime-betweenHours-8-16"},"\n","ev","str","^\"Indeed, my queen.\"","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^\"I will not help.\"","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["\n",{"->":"mission"},{"->":"0.g-0"},{"#f":5}],"c-1":["\n","end",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"mission":["^I replied with a respectful nod, embracing the challenge laid before me.","\n","^The prospect of a royal quest unfolded, intertwining my destiny with the mysteries of the beautiful queen and the quest for her elusive ring.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}