{"inkVersion":20,"root":[["^\"Who wants their hand bitten off? I was asleep!\" ",{"#":"changeSpeakerName-Magibara"},{"#":""},"\n","^It seemed the books were mistaken. ",{"#":"changeSpeakerName-Freya"},"\n","^\"Magnus informed me that thau be me familiar and would help with alchemy\"","\n","^\"I will do whatever I want!\"",{"#":"changeSpeakerName-Magibara"},"\n","^The capybara looked disconsolate, but his squeaky voice lacked any threat. ",{"#":"changeSpeakerName-Freya"},"\n","^\"I am pleased to make your acquaintance, sir.\"","\n","^\"Yeah, I'd also be pleased to meet such a magnificent creature like myself.\" ",{"#":"changeSpeakerName-Magibara"},"\n","^\"I hope our journey will be fruitful.\" ",{"#":"changeSpeakerName-Freya"},"\n","^\"You're a nice kid; you actually don't annoy me that much. If you'll treat me like the king I am, then we'll be good.\" ",{"#":"changeSpeakerName-Magibara"},"\n","^\"You are a king?\" ",{"#":"changeSpeakerName-Freya"},"\n","^I bowed down to the animal: capybaras reign on human lands?","\n","^\"No, of course not. Are you dense?\" ",{"#":"changeSpeakerName-Magibara"},"\n","^I couldn't comprehend what the animal was talking about. I didn't have enough time to dwell on it as the large rodent approached me, continuing his monologue. ",{"#":"changeSpeakerName-Freya"},"\n","^\"Hey, if you want to go with me, remember I won't coddle you. And the world isn't a great place; it's terrible, actually. Famine, wars, sickness—yet royalty lives without any problems. They're leeches!\"","\n","^\"I understand.\" ",{"#":"changeSpeakerName-Freya"},"\n","^I understood that Magibara wanted me to know his expectations. I stared at the rodent, expecting it to continue, but it didn't.","\n",{"->":"choice"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"choice":[["^\"Yeah...\" ",{"#":"option-0-changesInkFile-Dialogues/Magibara/Normal"},{"#":"option-0-forceCloseDialogue"},"\n","ev","str","^\"Shall we go, then?\"","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","end",{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}